org/potter.org
#+TITLE: A Literate Programming Solution to the Potter Kata (http://codingdojo.org/cgi-bin/wiki.pl?KataPotter)
#+AUTHOR: Gary W. Johnson
#+EMAIL: lambdatronic@gmail.com
#+DATE: 2012-09-10
# Copyright 2012 Gary W. Johnson (lambdatronic@gmail.com)

# To prepare your Emacs environment for tangling, weaving, or
# evaluating this file, follow these steps:
#
# Under SLIME + Swank-Clojure:
# 1. M-x org-babel-tangle (regenerates source files)
# 2. M-x clojure-jack-in (starts SLIME + Clojure)
# 3. C-c C-c (from within toplevel-load-block, loads source code into SLIME)
# 4. M-x org-export-as-html (regenerate woven HTML documentation)
#
# Under nrepl.el + NREPL:
# 1. M-x org-babel-tangle (regenerates source files)
# 2. M-x nrepl-jack-in (starts nrepl.el + NREPL)
# 3. M-x nrepl-interaction-mode (to enable NREPL keybindings in this buffer)
# 4. C-c C-c (from within toplevel-load-block, loads source code into NREPL)
# 5. M-x org-export-as-html (regenerate woven HTML documentation)
#
# As of the time of this writing (2012-09-10), there are some problems
# using Emacs with Swank-Clojure or nrepl.el. To work around this, add
# one of the following two code blocks to your emacs initialization
# file:
#
# Under SLIME + Swank-Clojure:
# ;; Patch result table rendering bug in ob-clojure (SLIME version)
# (defun org-babel-execute:clojure (body params)
#   "Execute a block of Clojure code with Babel."
#   (require 'slime)
#   (with-temp-buffer
#     (insert (org-babel-expand-body:clojure body params))
#     ((lambda (result)
#        (destructuring-bind (output value) result
#          (let ((result-params (cdr (assoc :result-params params))))
#            (if (or (member "scalar" result-params)
#                    (member "verbatim" result-params))
#                value
#              (condition-case nil (org-babel-script-escape value)
#                (error value))))))
#      (slime-eval
#       `(swank:eval-and-grab-output
#         ,(buffer-substring-no-properties (point-min) (point-max)))
#       (cdr (assoc :package params))))))
#
# Under nrepl.el + NREPL:
# ;; Patch ob-clojure to work with nrepl
# (declare-function nrepl-send-string-sync "ext:nrepl" (code &optional ns))
#
# (defun org-babel-execute:clojure (body params)
#   "Execute a block of Clojure code with Babel."
#   (require 'nrepl)
#   (with-temp-buffer
#     (insert (org-babel-expand-body:clojure body params))
#     ((lambda (result)
#        (let ((result-params (cdr (assoc :result-params params))))
#          (if (or (member "scalar" result-params)
#                  (member "verbatim" result-params))
#              result
#            (condition-case nil (org-babel-script-escape result)
#              (error result)))))
#      (plist-get (nrepl-send-string-sync
#                  (buffer-substring-no-properties (point-min) (point-max))
#                  (cdr (assoc :package params)))
#                 :value))))

#+name: toplevel-load-block
#+begin_src clojure :exports none :tangle ../src/potter.clj :padline no :results silent
(ns potter
  (:use [clojure.set :only [union intersection]]
        [clojure.math.combinatorics :only [combinations subsets]]))

<<partition?>>

<<find-power-set>>

<<find-all-partitions>>

<<find-all-basket-partitions-via-power-sets>>

<<find-discounted-subsets>>

<<find-all-basket-partitions-via-tree-traversal>>

<<get-bin-discount>>

<<calculate-bin-cost>>

<<calculate-partition-cost>>

<<find-minimum-cost-partition-naive>>

<<find-minimum-cost-partition-via-dynamic-programming>>
#+end_src

* Introduction

This is a very special document in that it not only explains the inner
workings of this software system but also contains the complete source
code of its implementation. Such a document is called a Literate
Program[fn:Foo: See http://en.wikipedia.org/wiki/Literate_programming
for more information.] after the software development paradigm
proposed by Donald Knuth in the late 1970s and first implemented in
his 1981 WEB system.

Unlike WEB and its later offspring CWEB, which were each limited to a
single programming language (Pascal and C respectively), this Literate
Program has been written using Emacs' Org-Mode[fn::
http://orgmode.org], allowing us to freely intermix any number of
programming languages to create our final product. The main
programming language we will use here is Clojure[fn::
http://clojure.org], a modern dialect of Lisp that targets the Java
Virtual Machine (JVM)[fn:: See
http://en.wikipedia.org/wiki/Java_virtual_machine for more
information.]. However, if we needed helper programs in other
languages (e.g., Bash, C++, Python), their code could also be freely
intermixed in this document and automatically extracted later for
compilation and execution.

In addition to reading this document, its Org source file (potter.org)
may be opened in Emacs and manipulated in three ways:

- Tangle :: Typing `M-x org-babel-tangle' will cause Emacs to extract
            all the source code blocks within potter.org into separate
            files and rearrange them into valid compilation order so
            that they may be compiled into an executable application.

- Weave :: Typing `M-x org-export-as-pdf' or `M-x org-export-as-html'
           will cause Emacs to generate an attractively typeset
           version of potter.org as either a PDF file (potter.pdf) or an
           HTML webpage (potter.html) respectively. This is likely the
           way in which the manual you are currently reading was
           created.

- Evaluate :: If potter.org is opened in Emacs' Org major mode (`M-x
              org-mode'), and Emacs is connected to an external
              Clojure process[fn:: Connecting to an external Clojure
              process is beyond the scope of this document but
              requires setting up either SLIME + Swank-Clojure and
              typing `M-x clojure-jack-in' or nrepl.el + NREPL and
              typing `M-x nrepl-jack-in', ], the code blocks within
              potter.org may be loaded and executed individually by the
              connected Clojure server using `M-x
              org-babel-execute-src-block' (typically bound to `C-c
              C-c').[fn:: See
              http://orgmode.org/manual/Evaluating-code-blocks.html
              for more information.]

See comments in the header section of potter.org for the specific order
in which the above Emacs commands should be executed.

* Problem Description

Once upon a time there was a series of 5 books about a very English
hero called Harry. (At least when this Kata was invented, there were
only 5. Since then they have multiplied) Children all over the world
thought he was fantastic, and, of course, so did the publisher. So in
a gesture of immense generosity to mankind, (and to increase sales)
they set up the following pricing model to take advantage of Harry's
magical powers.

One copy of any of the five books costs 8 EUR. If, however, you buy
two different books from the series, you get a 5% discount on those
two books. If you buy 3 different books, you get a 10% discount. With
4 different books, you get a 20% discount. If you go the whole hog,
and buy all 5, you get a huge 25% discount.

Note that if you buy, say, four books, of which 3 are different
titles, you get a 10% discount on the 3 that form part of a set, but
the fourth book still costs 8 EUR.

Potter mania is sweeping the country and parents of teenagers
everywhere are queueing up with shopping baskets overflowing with
Potter books. Your mission is to write a piece of code to calculate
the price of any conceivable shopping basket, giving as big a discount
as possible.

* Procedure

Given a shopping basket specification [1 1 3 2 1 5 3 4] (i.e., a
vector of the books present in the basket by their number in the
series), our goal is to find the partition of the basket's contents
that minimizes the total cost of purchasing the books in the basket.

