org/potter.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>A Literate Programming Solution to the Potter Kata (http://codingdojo.org/cgi-bin/wiki.pl?KataPotter)</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="A Literate Programming Solution to the Potter Kata (http://codingdojo.org/cgi-bin/wiki.pl?KataPotter)"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-10"/>
<meta name="author" content="Gary W. Johnson"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">A Literate Programming Solution to the Potter Kata (http://codingdojo.org/cgi-bin/wiki.pl?KataPotter)</h1>





<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 Problem Description</a></li>
<li><a href="#sec-3">3 Procedure</a>
<ul>
<li><a href="#sec-3-1">3.1 Find all partitions and then calculate their costs</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1 Find all basket partitions via power sets</a></li>
<li><a href="#sec-3-1-2">3.1.2 Find all basket partitions via tree traversal</a></li>
<li><a href="#sec-3-1-3">3.1.3 Calculate partition cost</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2 Find minimum cost partition directly via dynamic programming</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">


<p>
This is a very special document in that it not only explains the inner
workings of this software system but also contains the complete source
code of its implementation. Such a document is called a Literate
Program<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup> after the software development paradigm
proposed by Donald Knuth in the late 1970s and first implemented in
his 1981 WEB system.
</p>
<p>
Unlike WEB and its later offspring CWEB, which were each limited to a
single programming language (Pascal and C respectively), this Literate
Program has been written using Emacs' Org-Mode<sup><a class="footref" name="fnr.2" href="#fn.2">2</a></sup>, allowing us to freely intermix any number of
programming languages to create our final product. The main
programming language we will use here is Clojure<sup><a class="footref" name="fnr.3" href="#fn.3">3</a></sup>, a modern dialect of Lisp that targets the Java
Virtual Machine (JVM)<sup><a class="footref" name="fnr.4" href="#fn.4">4</a></sup>. However, if we needed helper programs in other
languages (e.g., Bash, C++, Python), their code could also be freely
intermixed in this document and automatically extracted later for
compilation and execution.
</p>
<p>
In addition to reading this document, its Org source file (potter.org)
may be opened in Emacs and manipulated in three ways:
</p>
<dl>
<dt>Tangle</dt><dd>Typing `M-x org-babel-tangle' will cause Emacs to extract
            all the source code blocks within potter.org into separate
            files and rearrange them into valid compilation order so
            that they may be compiled into an executable application.

</dd>
<dt>Weave</dt><dd>Typing `M-x org-export-as-pdf' or `M-x org-export-as-html'
           will cause Emacs to generate an attractively typeset
           version of potter.org as either a PDF file (potter.pdf) or an
           HTML webpage (potter.html) respectively. This is likely the
           way in which the manual you are currently reading was
           created.

</dd>
<dt>Evaluate</dt><dd>If potter.org is opened in Emacs' Org major mode (`M-x
              org-mode'), and Emacs is connected to an external
              Clojure process<sup><a class="footref" name="fnr.5" href="#fn.5">5</a></sup>, the code blocks within
              potter.org may be loaded and executed individually by the
              connected Clojure server using `M-x
              org-babel-execute-src-block' (typically bound to `C-c
              C-c').<sup><a class="footref" name="fnr.6" href="#fn.6">6</a></sup>
</dd>
</dl>


<p>
See comments in the header section of potter.org for the specific order
in which the above Emacs commands should be executed.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Problem Description</h2>
<div class="outline-text-2" id="text-2">


<p>
Once upon a time there was a series of 5 books about a very English
hero called Harry. (At least when this Kata was invented, there were
only 5. Since then they have multiplied) Children all over the world
thought he was fantastic, and, of course, so did the publisher. So in
a gesture of immense generosity to mankind, (and to increase sales)
they set up the following pricing model to take advantage of Harry's
magical powers.
</p>
<p>
One copy of any of the five books costs 8 EUR. If, however, you buy
two different books from the series, you get a 5% discount on those
two books. If you buy 3 different books, you get a 10% discount. With
4 different books, you get a 20% discount. If you go the whole hog,
and buy all 5, you get a huge 25% discount.
</p>
<p>
Note that if you buy, say, four books, of which 3 are different
titles, you get a 10% discount on the 3 that form part of a set, but
the fourth book still costs 8 EUR.
</p>
<p>
Potter mania is sweeping the country and parents of teenagers
everywhere are queueing up with shopping baskets overflowing with
Potter books. Your mission is to write a piece of code to calculate
the price of any conceivable shopping basket, giving as big a discount
as possible.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Procedure</h2>
<div class="outline-text-2" id="text-3">


<p>
Given a shopping basket specification [1 1 3 2 1 5 3 4] (i.e., a
vector of the books present in the basket by their number in the
series), our goal is to find the partition of the basket's contents
that minimizes the total cost of purchasing the books in the basket.
</p>

</div>
