org/potter.org
** Find all partitions and then calculate their costs

One approach that we could take to solve this problem is as follows:

1. Find all partitions of the shopping basket contents.
2. Calculate the cost of the shopping basket contents using each partition.
3. Select the minimum cost partition.

#+name: find-minimum-cost-partition-naive
#+begin_src clojure
(def find-all-basket-partitions find-all-basket-partitions-via-tree-traversal)

(defn find-minimum-cost-partition-naive [shopping-basket-books]
  (let [all-partitions (find-all-basket-partitions shopping-basket-books)
        all-costs      (map calculate-partition-cost all-partitions)]
    (apply min-key val (zipmap all-partitions all-costs))))
#+end_src

*** Find all basket partitions via power sets

A partition $P$ of a set $S$ is a subset of all its subsets, for which
the following three conditions hold:

1. $P$ does not contain the empty set $\emptyset$ (i.e., $\emptyset \notin P$).
2. The union of the elements of $P$ is equal to $S$.
3. The intersection of any two distinct elements of $P$ is the empty set $\emptyset$.

#+name: partition?
#+begin_src clojure
(defn partition? [P S]
  (and (not (contains? P #{}))
       (= (apply union P) S)
       (every? #(= (intersection (first %) (second %)) #{}) (combinations P 2))))
#+end_src

The set of all subsets of a set $S$ (including the empty set
$\emptyset$ and $S$ itself) is called the /power set/ of $S$. The
number of elements in the power set of $S$ is equal to $2^{|S|}$,
where $|S|$ is the number of elements in $S$.

#+name: find-power-set
#+begin_src clojure
(defn find-power-set [S]
  (set (map set (subsets S))))
#+end_src

To find all partitions of the set $S$, we could naively find all
subsets of its power set that satisfy the partition? predicate given
above.

#+name: find-all-partitions
#+begin_src clojure
(defn find-all-partitions [S]
  (filter #(partition? % S) (subsets (find-power-set S))))
#+end_src

Of course, since we are working with sets and no redundant elements
are allowed within sets, we must begin our analysis by mapping the
input shopping basket to a set of distinct elements. We do this by
representing each book in the basket by its index in the input vector.
Finally, once we have found all partitions of the index set, we
translate the returned indices back to their book numbers.

#+name: find-all-basket-partitions-via-power-sets
#+begin_src clojure
(defn find-all-basket-partitions-via-power-sets [shopping-basket-books]
  (let [S (set (range (count shopping-basket-books)))]
    (for [P (find-all-partitions S)]
      (for [subset P]
        (map shopping-basket-books subset)))))
#+end_src

