org/potter.html

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Find all partitions and then calculate their costs</h3>
<div class="outline-text-3" id="text-3-1">


<p>
One approach that we could take to solve this problem is as follows:
</p>
<ol>
<li>Find all partitions of the shopping basket contents.
</li>
<li>Calculate the cost of the shopping basket contents using each partition.
</li>
<li>Select the minimum cost partition.
</li>
</ol>





<pre class="src src-clojure">(<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">find-all-basket-partitions</span> find-all-basket-partitions-via-tree-traversal)

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">find-minimum-cost-partition-naive</span> [shopping-basket-books]
  (<span style="color: #b0c4de;">let</span> [all-partitions (find-all-basket-partitions shopping-basket-books)
        all-costs      (<span style="color: #eedd82;">map</span> calculate-partition-cost all-partitions)]
    (<span style="color: #eedd82;">apply</span> min-key val (<span style="color: #eedd82;">zipmap</span> all-partitions all-costs))))
</pre>



</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Find all basket partitions via power sets</h4>
<div class="outline-text-4" id="text-3-1-1">


<p>
A partition \(P\) of a set \(S\) is a subset of all its subsets, for which
the following three conditions hold:
</p>
<ol>
<li>\(P\) does not contain the empty set \(\emptyset\) (i.e., \(\emptyset \notin P\)).
</li>
<li>The union of the elements of \(P\) is equal to \(S\).
</li>
<li>The intersection of any two distinct elements of \(P\) is the empty set \(\emptyset\).
</li>
</ol>





<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">partition?</span> [P S]
  (<span style="color: #b0c4de;">and</span> (<span style="color: #eedd82;">not</span> (<span style="color: #eedd82;">contains?</span> P #{}))
       (<span style="color: #eedd82;">=</span> (<span style="color: #eedd82;">apply</span> union P) S)
       (<span style="color: #eedd82;">every?</span> #(<span style="color: #eedd82;">=</span> (<span style="color: #98fb98;">intersection</span> (<span style="color: #eedd82;">first</span> %) (<span style="color: #eedd82;">second</span> %)) #{}) (combinations P 2))))
</pre>


<p>
The set of all subsets of a set \(S\) (including the empty set
\(\emptyset\) and \(S\) itself) is called the <i>power set</i> of \(S\). The
number of elements in the power set of \(S\) is equal to \(2^{|S|}\),
where \(|S|\) is the number of elements in \(S\).
</p>



<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">find-power-set</span> [S]
  (<span style="color: #eedd82;">set</span> (<span style="color: #eedd82;">map</span> set (subsets S))))
</pre>


<p>
To find all partitions of the set \(S\), we could naively find all
subsets of its power set that satisfy the partition? predicate given
above.
</p>



<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">find-all-partitions</span> [S]
  (<span style="color: #eedd82;">filter</span> #(partition? % S) (subsets (find-power-set S))))
</pre>


<p>
Of course, since we are working with sets and no redundant elements
are allowed within sets, we must begin our analysis by mapping the
input shopping basket to a set of distinct elements. We do this by
representing each book in the basket by its index in the input vector.
Finally, once we have found all partitions of the index set, we
translate the returned indices back to their book numbers.
</p>



<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">find-all-basket-partitions-via-power-sets</span> [shopping-basket-books]
  (<span style="color: #b0c4de;">let</span> [S (<span style="color: #eedd82;">set</span> (<span style="color: #eedd82;">range</span> (<span style="color: #eedd82;">count</span> shopping-basket-books)))]
    (<span style="color: #b0c4de;">for</span> [P (find-all-partitions S)]
      (<span style="color: #b0c4de;">for</span> [subset P]
        (<span style="color: #eedd82;">map</span> shopping-basket-books subset)))))
</pre>


</div>

</div>
