org/potter.org
*** Find all basket partitions via tree traversal

Although mathematically correct, our first formulation is extremely
computationally inefficient and will scale poorly as the size of $S$
grows. Recall that our goal is to maximize the discount available to
the shopper, and since no discounts are applied for groups of less
than two books, we can exclude all such sets within the power set.

#+name: find-discounted-subsets
#+begin_src clojure
(defn find-discounted-subsets [S]
  (remove #(< (count %) 2) (subsets S)))

(defn find-discounted-subsets-alternate [S]
  (mapcat #(combinations S %) (range 2 6)))
#+end_src

Since we are working with sets and no redundant elements are allowed
within a set, we must begin our analysis by mapping the shopping
basket contents to a set of distinct elements. For our second attempt,
we do this by creating a map of distinct books (by their number in the
series) to the number of times each appears in the basket.

We can then envision a basket partitioning procedure, that proceeds by
iteratively selecting one of the discounted subsets of the
distinct books remaining in the basket until the basket is either
empty or only contains books which cannot be grouped into a
discounted subset. These remaining books are then grouped
together to form the final subset of the partition.

In order to explore all such possible partitions, we construct a tree
whose nodes are pairs of (book-freqs-in-basket, selected-book-groups).
Successor nodes are constructed by selecting all discounted subsets of
the parent node's book-freqs-in-basket and when none remain, simply
grouping together any books still in book-freqs-in-basket as the final
undiscounted subset. In such a tree, each path from the root node
(i.e., the initial shopping basket contents) to a leaf node (i.e., one
whose book-freqs-in-basket value is empty) represents a partition of
the tree. Each leaf node's selected-book-groups field will contain a
complete partition of the shopping basket contents. To find all
partitions, we simply traverse this tree and return the
selected-book-groups field on each leaf node.

#+name: find-all-basket-partitions-via-tree-traversal
#+begin_src clojure
(defstruct node :book-freqs-in-basket :selected-book-groups)

(defn remove-from-basket [book-freqs subset]
  (into {} (remove #(zero? (val %)) (reduce #(update-in %1 [%2] dec) book-freqs subset))))

(defn expand-book-freqs [book-freqs]
  (mapcat (fn [[book-id frequency]] (repeat frequency book-id)) book-freqs))

(defn successors [{:keys [book-freqs-in-basket selected-book-groups]}]
  (let [distinct-books (keys book-freqs-in-basket)]
    (if-let [discounted-book-groups (seq (find-discounted-subsets distinct-books))]
      (for [books discounted-book-groups]
        (struct-map node
          :book-freqs-in-basket (remove-from-basket book-freqs-in-basket books)
          :selected-book-groups (cons books selected-book-groups)))
      (let [undiscounted-book-group (expand-book-freqs book-freqs-in-basket)]
        (list (struct-map node
                :book-freqs-in-basket nil
                :selected-book-groups (if (seq undiscounted-book-group)
                                        (cons undiscounted-book-group selected-book-groups)
                                        selected-book-groups)))))))

(defn leaf-node? [node]
  (nil? (:book-freqs-in-basket node)))

(defn find-next-partition [[open-list partition]]
  (if-let [node (first open-list)]
    (if (leaf-node? node)
      [(rest open-list) (:selected-book-groups node)]
      (recur [(concat (successors node) (rest open-list)) nil]))))

(defn find-all-basket-partitions-via-tree-traversal [shopping-basket-books]
  (let [root-node (struct-map node
                    :book-freqs-in-basket (frequencies shopping-basket-books)
                    :selected-book-groups ())]
    (->> [(list root-node) nil]
         (iterate find-next-partition)
         rest
         (take-while seq)
         (map second))))
#+end_src

*** Calculate partition cost

The cost of a partition is simply calculated as the sum of the costs
of its bins.

#+name: calculate-partition-cost
#+begin_src clojure
(defn calculate-partition-cost [partition]
  (reduce + (map calculate-bin-cost partition)))
#+end_src

To calculate the cost of a bin, we first determine the bin discount,
which is a function of the number of distinct books in the bin as
described in [[Problem Description]].

#+name: get-bin-discount
#+begin_src clojure
(defn get-bin-discount [bin]
  (case (count (distinct bin))
    2 0.05
    3 0.10
    4 0.20
    5 0.25
    0.0))
#+end_src

We then multiply the number of books in the bin by the base book price
(given as 8 euros in the problem statement) and apply the bin discount
to the result.

#+name: calculate-bin-cost
#+begin_src clojure
(def base-book-price 8.00)

(defn calculate-bin-cost [bin]
  (* base-book-price (count bin) (- 1.0 (get-bin-discount bin))))
#+end_src

