org/potter.html

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Find all basket partitions via tree traversal</h4>
<div class="outline-text-4" id="text-3-1-2">


<p>
Although mathematically correct, our first formulation is extremely
computationally inefficient and will scale poorly as the size of \(S\)
grows. Recall that our goal is to maximize the discount available to
the shopper, and since no discounts are applied for groups of less
than two books, we can exclude all such sets within the power set.
</p>



<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">find-discounted-subsets</span> [S]
  (<span style="color: #eedd82;">remove</span> #(<span style="color: #eedd82;">&lt;</span> (<span style="color: #eedd82;">count</span> %) 2) (subsets S)))

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">find-discounted-subsets-alternate</span> [S]
  (<span style="color: #eedd82;">mapcat</span> #(combinations S %) (<span style="color: #eedd82;">range</span> 2 6)))
</pre>


<p>
Since we are working with sets and no redundant elements are allowed
within a set, we must begin our analysis by mapping the shopping
basket contents to a set of distinct elements. For our second attempt,
we do this by creating a map of distinct books (by their number in the
series) to the number of times each appears in the basket.
</p>
<p>
We can then envision a basket partitioning procedure, that proceeds by
iteratively selecting one of the discounted subsets of the
distinct books remaining in the basket until the basket is either
empty or only contains books which cannot be grouped into a
discounted subset. These remaining books are then grouped
together to form the final subset of the partition.
</p>
<p>
In order to explore all such possible partitions, we construct a tree
whose nodes are pairs of (book-freqs-in-basket, selected-book-groups).
Successor nodes are constructed by selecting all discounted subsets of
the parent node's book-freqs-in-basket and when none remain, simply
grouping together any books still in book-freqs-in-basket as the final
undiscounted subset. In such a tree, each path from the root node
(i.e., the initial shopping basket contents) to a leaf node (i.e., one
whose book-freqs-in-basket value is empty) represents a partition of
the tree. Each leaf node's selected-book-groups field will contain a
complete partition of the shopping basket contents. To find all
partitions, we simply traverse this tree and return the
selected-book-groups field on each leaf node.
</p>



<pre class="src src-clojure">(<span style="color: #00ffff;">defstruct</span> <span style="color: #87cefa;">node</span> <span style="color: #7fffd4;">:book-freqs-in-basket</span> <span style="color: #7fffd4;">:selected-book-groups</span>)

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">remove-from-basket</span> [book-freqs subset]
  (<span style="color: #eedd82;">into</span> {} (<span style="color: #eedd82;">remove</span> #(zero? (<span style="color: #eedd82;">val</span> %)) (<span style="color: #eedd82;">reduce</span> #(<span style="color: #eedd82;">update-in</span> %1 [%2] dec) book-freqs subset))))

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">expand-book-freqs</span> [book-freqs]
  (<span style="color: #eedd82;">mapcat</span> (<span style="color: #00ffff;">fn</span> [[book-id frequency]] (<span style="color: #eedd82;">repeat</span> frequency book-id)) book-freqs))

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">successors</span> [{<span style="color: #7fffd4;">:keys</span> [book-freqs-in-basket selected-book-groups]}]
  (<span style="color: #b0c4de;">let</span> [distinct-books (<span style="color: #eedd82;">keys</span> book-freqs-in-basket)]
    (<span style="color: #b0c4de;">if-let</span> [discounted-book-groups (<span style="color: #eedd82;">seq</span> (find-discounted-subsets distinct-books))]
      (<span style="color: #b0c4de;">for</span> [books discounted-book-groups]
        (<span style="color: #eedd82;">struct-map</span> node
          <span style="color: #7fffd4;">:book-freqs-in-basket</span> (remove-from-basket book-freqs-in-basket books)
          <span style="color: #7fffd4;">:selected-book-groups</span> (<span style="color: #eedd82;">cons</span> books selected-book-groups)))
      (<span style="color: #b0c4de;">let</span> [undiscounted-book-group (expand-book-freqs book-freqs-in-basket)]
        (<span style="color: #eedd82;">list</span> (<span style="color: #eedd82;">struct-map</span> node
                <span style="color: #7fffd4;">:book-freqs-in-basket</span> nil
                <span style="color: #7fffd4;">:selected-book-groups</span> (<span style="color: #b0c4de;">if</span> (<span style="color: #eedd82;">seq</span> undiscounted-book-group)
                                        (<span style="color: #eedd82;">cons</span> undiscounted-book-group selected-book-groups)
                                        selected-book-groups)))))))

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">leaf-node?</span> [node]
  (<span style="color: #eedd82;">nil?</span> (<span style="color: #7fffd4;">:book-freqs-in-basket</span> node)))

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">find-next-partition</span> [[open-list partition]]
  (<span style="color: #b0c4de;">if-let</span> [node (<span style="color: #eedd82;">first</span> open-list)]
    (<span style="color: #b0c4de;">if</span> (leaf-node? node)
      [(<span style="color: #eedd82;">rest</span> open-list) (<span style="color: #7fffd4;">:selected-book-groups</span> node)]
      (<span style="color: #b0c4de;">recur</span> [(<span style="color: #eedd82;">concat</span> (successors node) (<span style="color: #eedd82;">rest</span> open-list)) nil]))))

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">find-all-basket-partitions-via-tree-traversal</span> [shopping-basket-books]
  (<span style="color: #b0c4de;">let</span> [root-node (<span style="color: #eedd82;">struct-map</span> node
                    <span style="color: #7fffd4;">:book-freqs-in-basket</span> (frequencies shopping-basket-books)
                    <span style="color: #7fffd4;">:selected-book-groups</span> ())]
    (<span style="color: #b0c4de;">-&gt;&gt;</span> [(<span style="color: #eedd82;">list</span> root-node) nil]
         (<span style="color: #eedd82;">iterate</span> find-next-partition)
         rest
         (<span style="color: #eedd82;">take-while</span> seq)
         (<span style="color: #eedd82;">map</span> second))))
</pre>


</div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Calculate partition cost</h4>
<div class="outline-text-4" id="text-3-1-3">


<p>
The cost of a partition is simply calculated as the sum of the costs
of its bins.
</p>



<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">calculate-partition-cost</span> [partition]
  (<span style="color: #eedd82;">reduce</span> + (<span style="color: #eedd82;">map</span> calculate-bin-cost partition)))
</pre>


<p>
To calculate the cost of a bin, we first determine the bin discount,
which is a function of the number of distinct books in the bin as
described in <a href="#sec-2">Problem Description</a>.
</p>



<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">get-bin-discount</span> [bin]
  (<span style="color: #b0c4de;">case</span> (<span style="color: #eedd82;">count</span> (<span style="color: #eedd82;">distinct</span> bin))
    2 0.05
    3 0.10
    4 0.20
    5 0.25
    0.0))
</pre>


<p>
We then multiply the number of books in the bin by the base book price
(given as 8 euros in the problem statement) and apply the bin discount
to the result.
</p>



<pre class="src src-clojure">(<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">base-book-price</span> 8.00)

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">calculate-bin-cost</span> [bin]
  (<span style="color: #eedd82;">*</span> base-book-price (<span style="color: #eedd82;">count</span> bin) (<span style="color: #eedd82;">-</span> 1.0 (get-bin-discount bin))))
</pre>


</div>
</div>

</div>
